// # 변수 선언과 메모리 크기
package ch03;

public class Test01 {
  public static void main(String[] args) {
    // 1바이트 정수 값을 담을 메모리 준비
    byte b1; byte b2; byte b3;
    // 리터럴 값이 비록 4바이트 크기이지만 메모리에 넣을 수 있다면 허락한다.
    // 단, 8바이트 값은 담을 수 있더라도 허락하지 않는다. 컴파일 오류!
    b1 = -128; b2 = 127;  //b2 = 127L (X)
    //b3 = 128; 128은 1바이트 메모리에 담을 수 없기 때문에 컴파일 오류가 발생
    
    // 2바이트 정수 값을 담을 메모리 준비
    short s1; short s2; short s3;
    s1 = -32768; //OK
    s2 = 32767; //OK
    //s3 = 300L; 값이 작더라도 8바이트는 불가능
    //s3 = 32768; 메모리의 크기를 벗어난 크기이기 때문에 컴파일 오류가 발생
    
    // 4바이트 정수 값을 담을 메모리 준비
    int i1; int i2; int i3;
    i1 = -2100000000; //OK
    i2 = 2100000000; //OK
    //i2 = 2100000000L; //컴파일오류! 8바이트를 4바이트에 적재 불가능
    //i3 = 2200000000; // 리터럴 표현 오류! 4바이트 리터럴로는 22억을 표현할 수 없다. 
    //4바이트 초과하는 값을 표현
    
    // 8바이트 정수 값을 담을 메모리 준비
    long l1; long l2; long l3;
    
    l1 = 9000000000000000000L;
    //l2 = 9900000000000000000L; //8바이트 리터럴 표현 오류
    
    // 4바이트 부동 소수점을 담을 메모리 준비
    float f1; float f2;
    f1 = 98765.43f;
    f2 = 98765.43456789f; // 정수와 다른점!
    //유효 자릿수를 넘어가는 경우 짤려서 저장된다.
    //정수 메모리와 달리 컴파일 오류가 발생하지 않는다.
    //그래서 더더욱 주의해서 사용해야 한다.
    //가능한한 유효자릿수에 맞게 출력을 유도해야한다
    System.out.println(f1);
    System.out.println(f2);
    
    // 8바이트 부동 소수점을 담을 메모리 준비
    double d1; double d2;
    d1 = 98765.43; //주의! 8바이트 부동소수점을 표현할 때는 f, F 접미사 제거
    d2 = 98765.43456789; // 유효자릿수가 15자리까지 대부분 짤리지 않고 들어간다.
    //유효 자릿수를 넘어가는 경우 짤려서 저장된다.
    System.out.println(d1);
    System.out.println(d2);
    
    // 논리 값을 담을 메모리 준비
    boolean bool1; boolean bool2; boolean bool3;
    bool1 = true;
    bool2 = false;
    //bool1 = 1; true, false 외의 다른 값은 저장할 수 없다.
    
    // 문자의 UTF-16 코드 값을 담을 메모리 준비
    char c1; char c2; char c3;
    c1 = 44032; //4바이트 정수 값이라도 (러터럴)이더라도 0~65535까지의 값이라면
                //char 메모리에 저장하는 것을 허락한다.
    c2 = 0xac00;
    c3 = '가';
    //변수 자체가 char이기 때문에 (char)를 따로 붙이지 않아도 된다.
    System.out.println(c1); 
    System.out.println(c2);
    System.out.println(c3); 
  }
}
/*
 * # 변수
 *  - 값을 저장하는 메모리
 * # 변수 선언
 *  - 값을 저장하는 메모리를 준비하는 명령
 *  - 즉, 값을 저장할 메모리의 위치와 크기를 결정하고 그 메모리에 이름을 부여
 *  - 변수를 선언한 후 바로 그 이름을 사용하여 메모리에 접근하고 값을 넣고 꺼낸다. 
 *  - 보통 "변수를 생성"이라고 표현
 *  - 문법
 *    [메모리의 종류] [메로리 이름]; => int a;
 * # 메모리 종류
 * 1) Primitive data type(자바 원시 데이터 타입, 자바 기본 데이터 타입)
 *  - 정수
 *      - byte(1바이트) : -128 ~ 127
 *      - short(2바이트) : 32768 ~ 32767
 *      - int(4바이트) : 약 -21억 ~ +21억
 *      - long(8바이트) : 약 -900경 ~ + 900경
 *  - 부동소수점
 *      - float(4바이트) : 유효자릿수 7자리
 *      - double(8바이트) : 유효자릿수 15자리
 *  - 논리
 *      - boolean(JVM에서 4바이트(int 크기) 메모리를 사용)
 *  - 문자
 *      - char(2바이트) : 0 ~ 65535 즉, UTF-16 값 저장
 *  2) 레퍼런스(reference)
 *  - 객체의 주소를 저장하는 변수
 *  - 자바 기본 타입을 제외한 나머지 모두!
 *  
 *  # 변수의 이름
 *  - 대소문자 구분한다.
 *  - 보통 소문자로 시작
 *  - 여러 단어로 구성된 경우 두 번째 단어의 시작 알파벳을 대문자
 *      - firstName, createdDate, userId
 *  - 상수인 경우 보통 모두 대문자로 이름을 짓는다. 단어와 단어 사이는 _를 사용
 *      - USER_TYPE, USER_MANAGER
 */